Amiya200/stm32_water_tank/Core/Src/model_handle.c
void ModelHandle_StartTimerNearestSlot(void)
{
    ModelHandle_ProcessTimerSlots();
    ModelHandle_SendTimerInfoUART();
}
static uint32_t buzzerPatternStart = 0;
static bool     buzzerState        = false;
static inline void Buzzer_SetPin(bool on)
{
    HAL_GPIO_WritePin(LED5_GPIO_Port, LED5_Pin,
                      on ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

static void Buzzer_StartEvent(BuzzerEvent ev)
{
    if (activeBuzzEvent == ev) return;
    activeBuzzEvent    = ev;
    buzzerPatternStart = HAL_GetTick();
    buzzerState        = false;
}
#define TANK_FULL_BUZZ_MS 5000UL
static void Buzzer_TankEmptyPattern(void)
{
    uint32_t now = HAL_GetTick();
    if ((now - buzzerPatternStart) >= 15000UL) { Buzzer_SetPin(false); activeBuzzEvent = BUZZ_NONE; return; }
    Buzzer_SetPin(true);
}

static void Buzzer_TankFullPattern(void)
{
    uint32_t now = HAL_GetTick();
    if ((now - buzzerPatternStart) >= 15000UL) { Buzzer_SetPin(false); activeBuzzEvent = BUZZ_NONE; return; }
    Buzzer_SetPin(true);
}

static void Buzzer_Update(void)
{
    uint32_t now = HAL_GetTick();
    static uint32_t motorToggleTime          = 0;
    static bool     motorBuzzState           = false;
    static bool     manualTankFullBuzzActive = false;
    static uint32_t manualTankFullBuzzStart  = 0;
    static bool     prevTankFullManual       = false;
    bool motorOn  = Motor_GetStatus();
    bool tankFull = isTankFull();
    if (manualActive)
    {
        if (!motorOn)
        {
            Buzzer_SetPin(false);
            motorBuzzState           = false;
            motorToggleTime          = 0;
            manualTankFullBuzzActive = false;
            prevTankFullManual       = false;
            return;
        }
        if (tankFull && !prevTankFullManual)
        {
            manualTankFullBuzzActive = true;
            manualTankFullBuzzStart  = now;
            motorBuzzState           = false;
            motorToggleTime          = 0;
        }
        prevTankFullManual = tankFull;
        if (!tankFull && manualTankFullBuzzActive) manualTankFullBuzzActive = false;
        if (manualTankFullBuzzActive)
        {
            if ((now - manualTankFullBuzzStart) < TANK_FULL_BUZZ_MS) { Buzzer_SetPin(true); return; }
            else { manualTankFullBuzzActive = false; motorToggleTime = 0; motorBuzzState = false; }
        }
        if (buzzerSettings.pumpOnSound)
        {
            if ((now - motorToggleTime) >= 1000UL) { motorToggleTime = now; motorBuzzState = !motorBuzzState; }
            Buzzer_SetPin(motorBuzzState);
        }
        else Buzzer_SetPin(false);
        return;
    }
    manualTankFullBuzzActive = false;
    prevTankFullManual       = false;
    if (activeBuzzEvent == BUZZ_TANK_EMPTY) { Buzzer_TankEmptyPattern(); return; }
    if (activeBuzzEvent == BUZZ_TANK_FULL)  { Buzzer_TankFullPattern();  return; }

    if (motorOn)
    {
        if (buzzerSettings.pumpOnSound)
        {
            if ((now - motorToggleTime) >= 1000UL) { motorToggleTime = now; motorBuzzState = !motorBuzzState; }
            Buzzer_SetPin(motorBuzzState);
        }
        else Buzzer_SetPin(false);
        return;
    }
    Buzzer_SetPin(false);
}

static inline uint32_t now_ms(void) { return HAL_GetTick(); }

void ModelHandle_SetProtectionSettings(uint32_t retry_gap_sec,
                                        uint16_t dry_time_sec,
                                        uint8_t  dry_enable)
{
    if (retry_gap_sec < 60)    retry_gap_sec = 60;
    if (retry_gap_sec > 10800) retry_gap_sec = 10800;
    if (dry_time_sec  < 60)   dry_time_sec  = 60;
    if (dry_time_sec  > 900)  dry_time_sec  = 900;
    sys.gap_time_s     = retry_gap_sec;
    sys.dry_run_time_s = dry_time_sec;
    sys.dry_run_enable = dry_enable ? 1 : 0;
    ModelHandle_SaveSettingsToEEPROM();
}

static inline void clear_all_modes(void)
{
    manualActive    = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    timerActive     = false;
    autoActive      = false;
    manualOverride  = false;
    countdownMode   = false;
}

void ModelHandle_OnPowerUp(void)
{
    powerOnMs           = HAL_GetTick();
    autoBootIgnoreUntil = powerOnMs + 15000UL;
    bootStartBlockUntil = powerOnMs + MOTOR_START_DELAY_MS;
    autoDeadline        = 0;
    dryState            = DRY_IDLE;
    ModelHandle_LoadBuzzerSettings();
    if (timer_any_active_slot())
    {
        timerActive        = true;
        timerState         = TIMER_RUN_TEST;
        timerStateDeadline = 0;
        motorOwner         = MOTOR_OWNER_TIMER;
    }
    if (autoActive)
    {
        uint8_t level = get_tank_level_percent();
        if (level <= AUTO_START_LEVEL_PERCENT)
        {
            motorOwner    = MOTOR_OWNER_AUTO;
            autoState     = AUTO_ON_WAIT;
            stateDeadline = 0;
        }
        else
        {
            autoActive = false;
            motorOwner = MOTOR_OWNER_NONE;
        }
    }
}

static inline bool Motor_IsRelayOn(void)
{
    return HAL_GPIO_ReadPin(Relay1_GPIO_Port, Relay1_Pin) == GPIO_PIN_SET;
}

static bool Motor_StartAllowed(void)
{
    return !(senseOverLoad || senseUnderLoad || senseOverUnderVolt || senseMaxRunReached);
}

bool ModelHandle_IsRestartActive(void) { return restartActive; }

static inline void motor_apply(bool on)
{
    if (timerActive && timerState == TIMER_WAIT_RETRY) on = false;
    bool relayNow = Motor_IsRelayOn();
    if (on)
    {
        if (!Motor_StartAllowed()) return;
        if (!relayNow)
        {
            Relay_Set(1, true);
            motorOnStartMs = HAL_GetTick();
        }
        motorStatus = 1;
    }
    else
    {
        if (relayNow) Relay_Set(1, false);
        motorStatus = 0;
    }
    UART_SendStatusPacket();
}

bool Motor_GetStatus(void) { return Motor_IsRelayOn(); }

static inline void start_motor(void)
{
    if (HAL_GetTick() < bootStartBlockUntil) return;
    if (motorOwner == MOTOR_OWNER_NONE) return;
    if (dryState == DRY_FAULT && motorOwner != MOTOR_OWNER_MANUAL) return;
    motor_apply(true);
}

static inline void stop_motor(void) { motor_apply(false); }

