Amiya200/stm32_water_tank/Core/Src/model_handle.c
    if (modeSwitchPending)
    {
        if (now >= modeSwitchTime) { modeSwitchPending = false; motorOwner = pendingOwner; }
        return;
    }
    ModelHandle_CheckGroundWater();
    ModelHandle_CheckDryRun();
    ModelHandle_CheckLoadFault();
    check_max_run();
    bool protectionFault = senseOverLoad || senseUnderLoad || senseOverUnderVolt || senseMaxRunReached;
    bool tankFull        = isTankFull();
    MotorOwner newOwner;
    if      (restartActive)   newOwner = MOTOR_OWNER_RESTART;
    else if (timerActive)     newOwner = MOTOR_OWNER_TIMER;
    else if (manualActive)    newOwner = MOTOR_OWNER_MANUAL;
    else if (semiAutoActive)  newOwner = MOTOR_OWNER_SEMIAUTO;
    else if (countdownActive) newOwner = MOTOR_OWNER_COUNTDOWN;
    else if (twistActive)     newOwner = MOTOR_OWNER_TWIST;
    else if (autoActive)      newOwner = MOTOR_OWNER_AUTO;
    else                      newOwner = MOTOR_OWNER_NONE;
    motorOwner = newOwner;
    static bool prevTankFull      = false;
    static bool tankFullBuzzFired = false;

    if (motorOwner != prevMotorOwner)
    {
        prevTankFull      = false;
        tankFullBuzzFired = false;
        prevMotorOwner    = motorOwner;
    }
    if (tankFull && motorOwner != MOTOR_OWNER_MANUAL)
    {
        if (!prevTankFull)
        {
            tankFullDetectedAt = now;
            tankFullBuzzFired  = false;
        }
        if ((now - tankFullDetectedAt) >= TANK_FULL_DELAY_MS)
        {
            stop_motor();
            if (buzzerSettings.tankFullSound && !tankFullBuzzFired)
            {
                Buzzer_StartEvent(BUZZ_TANK_FULL);
                tankFullBuzzFired = true;
            }
        }
        prevTankFull = true;
    }
    else
    {
        prevTankFull = false;
        if (!tankFull) tankFullBuzzFired = false;
    }
    static uint8_t prevLevel = 100;
    uint8_t currentLevel = get_tank_level_percent();
    if (currentLevel == 0 && prevLevel > 0)
        if (buzzerSettings.tankEmptySound) Buzzer_StartEvent(BUZZ_TANK_EMPTY);
    prevLevel = currentLevel;
    switch (motorOwner)
    {
        case MOTOR_OWNER_RESTART:
            if (tankFull)
            {
                stop_motor(); restartActive = false;
                if (buzzerSettings.tankFullSound && !tankFullBuzzFired)
                    { Buzzer_StartEvent(BUZZ_TANK_FULL); tankFullBuzzFired = true; }
                dryState = DRY_IDLE;
                restore_previous_mode();
                ModelHandle_SaveModeState();
                break;
            }
            if (protectionFault) { stop_motor(); break; }
            start_motor();
            break;
        case MOTOR_OWNER_MANUAL:
            if (!protectionFault) start_motor(); else stop_motor();
            break;
        case MOTOR_OWNER_SEMIAUTO:
            if (protectionFault)
            {
                stop_motor();
            }
            else if (tankFull)
            {
                stop_motor();
            }
            else
            {
                start_motor();
            }
            break;
        case MOTOR_OWNER_TIMER:
            ModelHandle_ProcessTimerSlots();
            break;
        case MOTOR_OWNER_COUNTDOWN:
            if (!countdownActive) break;
            if (now >= cd_deadline) { ModelHandle_StopCountdown(); break; }
            countdownDuration = (cd_deadline - now) / 1000UL;
            if (protectionFault) { ModelHandle_StopCountdown(); break; }
            if (tankFull)
            {
                stop_motor();
            }
            else
            {
                start_motor();
            }
            break;
        case MOTOR_OWNER_TWIST:
            if (protectionFault) { stop_motor(); break; }
            twist_tick();
            break;
        case MOTOR_OWNER_AUTO:
            auto_tick();
            break;
        default:
            stop_motor();
            break;
    }
    ModelHandle_SoftDryRunHandler();
    if ((motorOwner == MOTOR_OWNER_NONE || motorOwner == MOTOR_OWNER_AUTO) &&
        !tankFull &&
        dryState != DRY_FAULT)
    {
        auto_mode_background_control();
    }
    leds_from_model();
    Buzzer_Update();
}

DryFSMState ModelHandle_GetDryState(void) { return dryState; }

void ModelHandle_ResetAll(void)
{
    clear_all_modes();
    stop_motor();
    senseDryRun        = false;
    senseOverLoad      = false;
    senseUnderLoad     = false;
    senseOverUnderVolt = false;
    senseMaxRunReached = false;
    countdownDuration  = 0;
    dryState           = DRY_IDLE;
    UART_SendStatusPacket();
}

void ModelHandle_SetUserSettings(uint32_t gap_seconds,
                                 uint8_t  retry,
                                 uint16_t uv_limit,
                                 uint16_t ov_limit,
                                 int16_t  overload,
                                 int16_t  underload,
                                 uint16_t maxrun_min)
{
    if (gap_seconds > 86400UL) gap_seconds = 86400UL;
    if (retry > 20)            retry       = 20;
    if (maxrun_min > 1440)     maxrun_min  = 1440;
    sys.gap_time_s  = gap_seconds;
    sys.retry_count = retry;
    sys.uv_limit    = uv_limit;
    sys.ov_limit    = ov_limit;
    sys.overload    = (float)overload;
    sys.underload   = (float)underload;
    sys.maxrun_min  = maxrun_min;
    if (gap_seconds == 0) sys.dry_run_enable = 0;
    ModelHandle_SaveSettingsToEEPROM();
    senseOverLoad = senseUnderLoad = senseOverUnderVolt = senseMaxRunReached = false;
    if (autoActive)
    {
        uint32_t gap = sys.gap_time_s ? sys.gap_time_s : 120;
        autoDeadline = HAL_GetTick() + (gap * 1000UL);
    }
    char dbg[80];
    snprintf(dbg, sizeof(dbg),
        "@SYS_UPDATE:GAP:%lu RET:%d UV:%d OV:%d MAX:%d DR:%d#",
        sys.gap_time_s, sys.retry_count, sys.uv_limit,
        sys.ov_limit, sys.maxrun_min, sys.dry_run_enable);
    UART_TransmitPacket(dbg);
}

void ModelHandle_SetAutoSettings(uint16_t gap_s, uint16_t maxrun_min, uint8_t retry)
{
    auto_gap_s       = (gap_s < 30) ? 120 : gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    EEPROM_WriteBlockSafe(0x0300, (uint8_t*)&auto_gap_s,       sizeof(auto_gap_s));
    EEPROM_WriteBlockSafe(0x0302, (uint8_t*)&auto_maxrun_min,  sizeof(auto_maxrun_min));
    EEPROM_WriteBlockSafe(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
}

bool ModelHandle_IsAutoActive(void) { return autoActive; }

void ModelHandle_SaveCurrentStateToEEPROM(void)
{
    RTC_PersistState s;
    memset(&s, 0, sizeof(s));
    if      (manualActive)    s.mode = 1;
    else if (semiAutoActive)  s.mode = 2;
    else if (timerActive)     s.mode = 3;
    else if (countdownActive) s.mode = 4;
    else if (twistActive)     s.mode = 5;
    else if (autoActive)      s.mode = 6;
    RTC_SavePersistentState(&s);
}

void ModelHandle_SetTimerSlot(uint8_t slot,
                              uint8_t onH, uint8_t onM,
                              uint8_t offH, uint8_t offM)
{
    timerSlots[slot].onHour    = onH;
    timerSlots[slot].onMinute  = onM;
    timerSlots[slot].offHour   = offH;
    timerSlots[slot].offMinute = offM;
    timerSlots[slot].enabled   = 1;
    ModelHandle_SendTimerInfoUART();
}

